---
title: LineProperties
classe: Autodesk.Revit.DB.LineProperties
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# LineProperties

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Color Color { get; }` | `lineProperties.Color` | Color |
| `Boolean IsValidObject { get; }` | `lineProperties.IsValidObject` | Boolean |
| `Double LineWidth { get; }` | `lineProperties.LineWidth` | Double |
| `ElementId PatternId { get; }` | `lineProperties.PatternId` | ElementId |
| `Int32 Transparency { get; }` | `lineProperties.Transparency` | Int32 |
| `Void Dispose()` | `lineProperties.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```